app/Controllers/Karakter.php

    public function index()
    {
        $jumlahBaris = 10;
        $katakunci = $this->request->getGet('katakunci');
        if($katakunci){
            $pencarian = $this->model->cari($katakunci);
        }else{
            $pencarian = $this->model;
        }
        $data['katakunci'] = $katakunci;
        $data['dataKarakter'] = $pencarian->orderBy('ID', 'desc')->paginate($jumlahBaris);
---
SELECT *
FROM `karakter`
ORDER BY `ID` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `karakter`